abadgirl/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 100]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 8]]
---
  def show
    @post = Post.find_by_id(params[:id])
    @user = User.find_by_id(params[:id])